src/cfe/ВнешнееХранениеФайлов/Catalogs/ТомаХраненияФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>ТомаХраненияФайлов</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>внеш_хф_ТипХранилища</Name>
					<Type>
						<v8:Type>cfg:EnumRef.внеш_хф_ТипыХранилищ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>внеш_хф_selectel_НомерУчётнойЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>внеш_хф_selectel_auth_user</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>внеш_хф_selectel_auth_password</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>внеш_хф_selectel_container</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйПутьWindows</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйПутьLinux</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокЗаполнения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйРазмер</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/ВнешнееХранениеФайлов/Enums/внеш_хф_ТипыХранилищ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>внеш_хф_ТипыХранилищ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>SelectelSwiftAPI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СетеваяПапка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/ВнешнееХранениеФайлов/Catalogs/ТомаХраненияФайлов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура внеш_хф_ТипХранилищаПриИзменении(Элемент)
	
	ОбновитьВидимостьГруппНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьГруппНастроек()
	
	Элементы.ГруппаПути.Видимость = (Объект.внеш_хф_ТипХранилища = ПредопределенноеЗначение("Перечисление.внеш_хф_ТипыХранилищ.СетеваяПапка"));
	Элементы.ГруппаSelectelSwiftAPI.Видимость = (Объект.внеш_хф_ТипХранилища = ПредопределенноеЗначение("Перечисление.внеш_хф_ТипыХранилищ.SelectelSwiftAPI"));
	
КонецПроцедуры


&НаКлиенте
Процедура внеш_хф_ПриОткрытииПосле(Отказ)
	ОбновитьВидимостьГруппНастроек();
КонецПроцедуры


&НаКлиенте
Процедура внеш_хф_ПослеЗаписиПосле(ПараметрыЗаписи)
	ОбновитьВидимостьГруппНастроек();
КонецПроцедуры
